---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WorksharingFailures.SeriousElementReferenceCorruption
source: html/ece5a746-cfee-9bc2-7e3d-047ea95e9ada.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WorksharingFailures.SeriousElementReferenceCorruption Property

Element references are seriously corrupt.

## Syntax (C#)
```csharp
public static FailureDefinitionId SeriousElementReferenceCorruption { get; }
```